package my.home.epam.module_1.loops_extra.task03;

/*
 * Задача 3. Необходимо вывести на экран таблицу умножения на 3.
 */

public class Main {

    public static void main(String[] args) {
	for (int i = 1; i <= 10; i++) {
	    System.out.println(i + " * 3 = " + i * 3);
	}
    }
}