package my.home.epam.module_1.loops_extra.task01;

/*
 * Задача 1. Необходимо вывести на экран числа от 1 до 5.
 */

public class Main {

    public static void main(String[] args) {
	for (int i = 1; i <= 5; i++) {
	    System.out.print(i + " ");
	}
    }
}