package loops.extra_tasks.task02.main;

/*
 * Задача 2. Необходимо вывести на экран числа от 5 до 1.
 */

public class Main {

    public static void main(String[] args) {
	for (int i = 5; i >= 1; i--) {
	    System.out.print(i + " ");
	}
    }
}