package linear_programs.extra_tasks.task02.main;

/*
 * Задача 2. Найдите значение функции: с = 3 + а.
 */

public class Main {

    public static void main(String[] args) {
	double a = 2.5;

	double c = 3 + a;
	System.out.println("При a = " + a + " значение фунции c = " + c);
    }
}